using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Kviskoteka
{
    public class KvizomanijaData
    {
        public List<string> questions;
        public List<List<string>> givenAnswers;
        public List<string> trueAnswers;


        public KvizomanijaData()
        {
            questions = new List<string>
            {
                "Стаклениот сад каде се чуваат копнени животинки и разни мали растенија се вика:",
                "Вид глодар сличен на мачка или куна кој ги уништува змиите:",
                "Што се мери со Бофорова скала?",
                "Кој хемиски елемент е неопходен за работа на тироидната жлезда?",
                "Кој од броевите не е квадрат од друг цел број:",
                "Англискиот писател и драматург Вилијам Шекспир, пишува за Хамлет, принцот од:",
                "Демир Капија и Демир Хисар се гратчиња во Македонија. Демир значи:",
                "Производството на нафта се изразува во барели. Барел е единица за:",
                "Трите краци во логото (знакот) на мерцедес значат:",
                "Зборови со иста форма но различно значење се викаат:",
                "Цврстиот јаглерод диоксид е познат како:",
                "Техниката за изработка на накит од тенка сребрена или златна жица се вика:",
                "Загатка во која со прераспоредување на буквите од еден се добива друг збор (на пример марс и срам) се вика:",
                "Назив за претежок, невозможен и бесмислен труд е:",
                "Синагога е:",
                "Пабло Пикасо е основач на правец во уметноста наречен:",
                "Витраж е уметничко дело направено на:",
                "Кој зеленчук е најбогат со витамин С?",
                "Според легендата, мечот Екскалибур му припаѓа на кралот:",
                "Колку страни има триаголната призма?"
            };

            givenAnswers = new List<List<string>> {
                new List<string>{"зоовариум", "влечугариум", "терариум", "анималиум"},
                new List<string>{"мунгос", "бурсук", "дабар", "рис"},
                new List<string>{"јачина на земјотрес", "брзина на ветер", "јачина на звук", "воздушен притисок"},
                new List<string>{"флуор", "натриум", "јод", "хлор"},
                new List<string>{"121", "144", "181", "256"},
                new List<string>{"Данска", "Англија", "Холандија", "Шкотска"},
                new List<string>{"златен", "железен", "висок", "жежок"},
                new List<string>{"маса", "густина", "тежина", "волумен"},
                new List<string>{"Копно, море и воздух", "Тројца браќа во семејството", "Брзина, квалитет и издржливост", "Три шампионски титули во Ф1"},
                new List<string>{"синоними", "антоними", "хомоними", "ламарини"},
                new List<string>{"црн чад", "фреон", "сублимат", "сув мраз"},
                new List<string>{"финеса", "филинг", "филигран", "филатерија"},
                new List<string>{"палиндром", "ребус", "крстозбор", "анаграм"},
                new List<string>{"икарова работа", "сократова работа", "сизифова работа", "едипова работа"},
                new List<string>{"ескимска куќа од мраз", "верски храм на Евреите", "стилска фигура", "живеалиште на Викинзите"},
                new List<string>{"кубизам", "импресионизам", "експресионизам", "натурализам"},
                new List<string>{"ѕид", "платно", "стакло", "метал"},
                new List<string>{"брокула", "домат", "пиперка", "зелка"},
                new List<string>{"Артур", "Ричард", "Хенри", "Едвард"},
                new List<string>{"3", "4", "5", "6"}
            };

            trueAnswers = new List<string>
            {
                "терариум", "мунгос", "брзина на ветер", "јод", "181",
                "Данска", "железен", "волумен", "Копно, море и воздух", "хомоними",
                "сув мраз", "филигран", "анаграм", "сизифова работа", "верски храм на Евреите",
                "кубизам", "стакло", "пиперка", "Артур", "5"
            };
        }
    }
}
